Revit API Introduction Labs
Lab2_3_ListWallsAndDoors Class
 Retrieving family instances: list all walls and doors. These represent two different kinds of elements: walls are represented by their own specialised System.Type Wall, whereas doors are represented by family instances and need to be identified by additionally checking the category.
 Revit uses categories to classify building elements and other groups of objects. The known categories are listed by the built-in categories enumeration. It includes values for walls, doors, windows and many other groups of objects. This is one way of identifying objects in the Revit database.
 Another way of identifying an element is using its System.Type, i.e. class. Walls are represented by their own specialised System.Type Wall, whereas doors and windows are represented by family instances, whose class is FamilyInstace. To tell them apart, we need to aditionally checking their category.
 Many classes of elements are grouped into types and families. There are system families, which are built into Revit, and standard families, which are defined in external files with an RFA filename extension.
 The are many other element properties that also can be used to retrieve specific element collections from the database.
 Walls are defined using a system family, doors and windows by standard families. To retrieve all walls, one can use an element filter checking for the wall category and the dedicated Wall class. For doors or windows, one can use the door and window categories and the FamilyInstance class.
 In this lab, we implement the filtering inline. Afterwards, we can use this code as a template for creating some reusable generic LabUtils methods.
 Implement a new read-only external command Lab2_3_ListWallsAndDoors and add the code to implement the Execute method and access the application app and current document doc.
 Implement a filtered element collector to retrieve and list all walls, for instance by the following steps:
Instantiate a new FilteredElementCollector variable named walls.
Retrieve all elements whose System.Type is Wall (hint: use OfClass).
Instantiate a variable named 'a' as a list of strings to collect the element information and later feed to the approriate LabUtils.InfoMsg overload.
Loop over the collected elements (hint: you can simply use foreach Wall wall in walls).
Populate 'a' with some element data such as element id, wall type and wall type kind.
Display the contents of 'a' using the appropriate LabUtils.InfoMsg overload.
Here is a possible implementation:
CopyC#
// get all wall elements:
//
// we could also call
//
// FilteredElementCollector walls = LabUtils.GetElementsOfType(
//   doc, typeof( Wall ), BuiltInCategory.OST_Walls );
FilteredElementCollector walls = new FilteredElementCollector( doc );
walls.OfClass( typeof( Wall ) );
List<string> a = new List<string>();
foreach( Wall wall in walls )
{
  a.Add( string.Format( "Id={0}; Kind={1}; Type={2}",
    wall.Id.IntegerValue,
    wall.WallType.Kind.ToString(),
    wall.WallType.Name ) );
}
LabUtils.InfoMsg( "{0} wall{1} in the model{2}", a );
CopyVB.NET
' get all wall elements:
'
' we could also call
'
' Dim walls As FilteredElementCollector =
' LabUtils.GetElementsOfType(doc, GetType(Wall), BuiltInCategory.OST_Walls)
Dim walls As New FilteredElementCollector(doc)
walls.OfClass(GetType(Wall))
Dim a As New List(Of String)()
For Each wall As Wall In walls
    a.Add(String.Format("Id={0}; Kind={1}; Type={2}", _
                        wall.Id.IntegerValue, _
                        wall.WallType.Kind.ToString(), _
                        wall.WallType.Name))
Next
LabUtils.InfoMsg("{0} wall{1} in the model{2}", a)
This shows how easy and succinct the Revit 2011 element filtering is.
 Implement a similar filter to retrieve and list all doors. In this case, we can use the FamilyInstance System.Type and additionally check for the door category using the OfCategory method and the appropriate built-in category enumeration vlue.
CopyC#
// get all door family instances:
//
// we could also call
//
// FilteredElementCollector doors = LabUtils.GetElementsOfType(
//   doc, typeof( FamilyInstance ), BuiltInCategory.OST_Doors );
//
// or
//
// FilteredElementCollector doors = LabUtils.GetFamilyInstances(
//   doc, BuiltInCategory.OST_Doors );
FilteredElementCollector doors = new FilteredElementCollector( doc );
doors.OfCategory( BuiltInCategory.OST_Doors );
doors.OfClass( typeof( FamilyInstance ) );
foreach( FamilyInstance door in doors )
{
  // For family instances, the element name property
  // returns the type name:
  a.Add( string.Format( "Id={0}; Type={1}",
    door.Id.IntegerValue, door.Name ) );
}
LabUtils.InfoMsg( "{0} door family instance{1} in the model{2}", a );
CopyVB.NET
' get all door family instances:
'
' we could also call
'
' Dim doors As FilteredElementCollector =
'   LabUtils.GetElementsOfType(doc, GetType(FamilyInstance), BuiltInCategory.OST_Doors)
'
' or
'
' Dim doors As FilteredElementCollector =
'   LabUtils.GetFamilyInstances(doc, BuiltInCategory.OST_Doors)
Dim doors As New FilteredElementCollector(doc)
doors.OfCategory(BuiltInCategory.OST_Doors)
doors.OfClass(GetType(FamilyInstance))
For Each door As FamilyInstance In doors
    ' For family instances, the element name property
    ' returns the type name:
    a.Add(String.Format("Id={0}; Type={1}", _
                        door.Id.IntegerValue, _
                        door.Name))
Next
LabUtils.InfoMsg("{0} door family instance{1} in the model{2}", a)
 Since similar kinds of element retrieval will be needed in other places as well, we can implement the following generic LabUtils methods for it:
CopyC#
/// <summary>
/// Return all elements of the requested class,
/// i.e. System.Type, matching the given built-in
/// category in the given document.
/// </summary>
public static FilteredElementCollector
  GetElementsOfType(
    Document doc,
    Type type,
    BuiltInCategory bic )
{
  FilteredElementCollector collector
    = new FilteredElementCollector( doc );
  collector.OfCategory( bic );
  collector.OfClass( type );
  return collector;
}
CopyVB.NET
''' <summary>
''' Return all elements of the requested class in the active document
''' matching the given built-in category.
''' </summary>
Public Shared Function GetElementsOfType( _
    ByVal doc As Document, _
    ByVal type As Type, _
    ByVal bic As BuiltInCategory) _
    As FilteredElementCollector
    Dim collector As New FilteredElementCollector(doc)
    collector.OfCategory(bic)
    collector.OfClass(type)
    Return collector
End Function
CopyC#
/// <summary>
/// Retrieve all standard family instances for a given category.
/// Todo: Compare this with the FamilyInstanceFilter class.
/// </summary>
public static FilteredElementCollector GetFamilyInstances(
  Document doc,
  BuiltInCategory bic )
{
  /* 2009:
  List<Element> elements = new List<Element>();
  Filter filterType = app.Create.Filter.NewTypeFilter( typeof( FamilyInstance ) );
  Filter filterCategory = app.Create.Filter.NewCategoryFilter( bic );
  Filter filterAnd = app.Create.Filter.NewLogicAndFilter( filterType, filterCategory );
  app.ActiveDocument.get_Elements( filterAnd, elements );
  return elements;
  */
  return GetElementsOfType( doc, typeof( FamilyInstance ), bic );
}
CopyVB.NET
''' <summary>
''' Retrieve all standard family instances for a given category.
''' </summary>
Shared Function GetFamilyInstances( _
    ByVal doc As Document, _
    ByVal bic As BuiltInCategory) _
As FilteredElementCollector
    ' For Revit 2009, this was
    'Dim elements As New System.Collections.Generic.List(Of Element)
    'Dim filterType As Filter = app.Create.Filter.NewTypeFilter(GetType(FamilyInstance))
    'Dim filterCategory As Filter = app.Create.Filter.NewCategoryFilter(bic)
    'Dim filterCombination As Filter = app.Create.Filter.NewLogicAndFilter(filterCategory, filterType)
    'Dim nRetVal As Integer = app.ActiveDocument.Elements(filterCombination, elements)
    'Return elements
    Return GetElementsOfType(doc, GetType(FamilyInstance), bic)
End Function
Compile, link and load the project as usual.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_3_ListWallsAndDoors : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_3_ListWallsAndDoors _
	Implements IExternalCommand
Visual C++
public ref class Lab2_3_ListWallsAndDoors : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab2_3_ListWallsAndDoors
See Also
Lab2_3_ListWallsAndDoors Members
Labs Namespace